Тест_ЗУП_31_КОРП/src/Enums/ВидыПрофессиональнойПодготовки/ВидыПрофессиональнойПодготовки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПрофессиональнойПодготовки</name>
  <enumValues>
    <name>Переподготовка</name>
  </enumValues>
  <enumValues>
    <name>ПовышениеКвалификации</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/ПолФизическогоЛица/ПолФизическогоЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолФизическогоЛица</name>
  <enumValues>
    <name>Мужской</name>
  </enumValues>
  <enumValues>
    <name>Женский</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ИсточникиИнформацииОКандидатах/ИсточникиИнформацииОКандидатах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсточникиИнформацииОКандидатах</name>
  <predefined>
    <items>
      <name>HeadHunter</name>
      <description>HeadHunter</description>
    </items>
    <items>
      <name>Rabota</name>
      <description>Rabota</description>
    </items>
    <items>
      <name>RabotaMail</name>
      <description>Rabota.mail</description>
    </items>
    <items>
      <name>SuperJob</name>
      <description>SuperJob</description>
    </items>
  </predefined>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/ВидыОбразованияФизическихЛиц/ВидыОбразованияФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОбразованияФизическихЛиц</name>
  <predefined>
    <items>
      <name>Адъюнктура</name>
      <description>Адъюнктура</description>
    </items>
    <items>
      <name>АспирантураОрдинатураАдъюнктура</name>
      <description>Аспирантура</description>
    </items>
    <items>
      <name>ВысшееОбразование</name>
      <description>Высшее образование</description>
    </items>
    <items>
      <name>ВысшееОбразованиеБакалавриат</name>
      <description>Высшее образование - бакалавриат</description>
    </items>
    <items>
      <name>ВысшееОбразованиеПодготовкаКадровВысшейКвалификации</name>
      <description>Высшее образование - подготовка кадров высшей квалификации</description>
    </items>
    <items>
      <name>ВысшееОбразованиеСпециалитетМагистратура</name>
      <description>Высшее образование - специалитет, магистратура</description>
    </items>
    <items>
      <name>Докторантура</name>
      <description>Докторантура</description>
    </items>
    <items>
      <name>ДополнительноеПрофессиональноеОбразование</name>
      <description>Дополнительное профессиональное образование</description>
    </items>
    <items>
      <name>Интернатура</name>
      <description>Интернатура</description>
    </items>
    <items>
      <name>НачальноеПрофессиональноеОбразование</name>
      <description>Начальное профессиональное образование</description>
    </items>
    <items>
      <name>НеполноеВысшееОбразование</name>
      <description>Неполное высшее образование</description>
    </items>
    <items>
      <name>Ординатура</name>
      <description>Ординатура</description>
    </items>
    <items>
      <name>ОсновноеОбщееОбразование</name>
      <description>Основное общее образование</description>
    </items>
    <items>
      <name>ПослевузовскоеОбразование</name>
      <description>Послевузовское образование</description>
    </items>
    <items>
      <name>ПрофессиональноеОбучение</name>
      <description>Профессиональное обучение</description>
    </items>
    <items>
      <name>СреднееПолноеОбщееОбразование</name>
      <description>Среднее (полное) общее образование</description>
    </items>
    <items>
      <name>СреднееОбщееОбразование</name>
      <description>Среднее общее образование</description>
    </items>
    <items>
      <name>СреднееПрофессиональноеОбразование</name>
      <description>Среднее профессиональное образование</description>
    </items>
  </predefined>
  <attributes>
    <name>ФасетОКИН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/CommonModules/ИнтеграцияРекрутинговыхСайтовКлиентСерверРедакция3/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция HeadHunter() Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.HeadHunter");
	
КонецФункции

Функция SuperJob() Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.SuperJob");
	
КонецФункции

Функция Rabota() Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.Rabota");
	
КонецФункции

Функция RabotaMail() Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.RabotaMail");
	
КонецФункции

Функция СоответствиеПоФиксированномуСоответствию(ФиксСоответствие) Экспорт
	
	Возврат Новый Соответствие(ФиксСоответствие);

КонецФункции

Функция НайтиВСтроке(СтрокаДляПоиска, ИскомаяСтрока, НаправлениеПоискаЧисло = 1) Экспорт
	
	Возврат СтрНайти(СтрокаДляПоиска, ИскомаяСтрока, ?(НаправлениеПоискаЧисло = 1, НаправлениеПоиска.СНачала, НаправлениеПоиска.СКонца));
	
КонецФункции

Функция ВидОбразованияПоИдентификаторуHeadHunter(Идентификатор) Экспорт 
	
	ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка");
	
	Если Идентификатор = "higher" Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразование");
	ИначеЕсли Идентификатор = "unfinished_higher" Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.НеполноеВысшееОбразование");
	ИначеЕсли Идентификатор = "special_secondary" Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование");
	ИначеЕсли Идентификатор = "secondary" Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование");
	ИначеЕсли Идентификатор = "bachelor" Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат");
	ИначеЕсли Идентификатор = "master" Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура");
	ИначеЕсли Идентификатор = "candidate" Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.АспирантураОрдинатураАдъюнктура");
	ИначеЕсли Идентификатор = "doctor" Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.Докторантура");
	КонецЕсли;

	Возврат ВидОбразования;
	
КонецФункции

Функция ВидОбразованияПоИдентификаторуRabota(Идентификатор) Экспорт 
	
	ДанныеОбразования = Новый Структура("ВидОбразования, ВидПослевузовскогоОбразования, ВидДополнительногоОбучения");
	ДанныеОбразования.ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка");
	
	Если (Идентификатор = 1
		Или Идентификатор = 5) Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование");
	ИначеЕсли (Идентификатор = 2
		Или Идентификатор = 6) Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование");
	ИначеЕсли (Идентификатор = 3
		Или Идентификатор = 7) Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.НеполноеВысшееОбразование");
	ИначеЕсли (Идентификатор = 4
		Или Идентификатор = 12) Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразование");
	ИначеЕсли (Идентификатор = 8
		Или Идентификатор = 9) Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура");
	ИначеЕсли Идентификатор = 10 Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование");
		ДанныеОбразования.ВидДополнительногоОбучения = ПредопределенноеЗначение("Перечисление.ВидыПрофессиональнойПодготовки.ПовышениеКвалификации");
	ИначеЕсли Идентификатор = 11 Тогда
		ДанныеОбразования.ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование");
		ДанныеОбразования.ВидДополнительногоОбучения = ПредопределенноеЗначение("Перечисление.ВидыПрофессиональнойПодготовки.Переподготовка");
	ИначеЕсли Идентификатор = 13 Тогда 
		ДанныеОбразования.ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеПодготовкаКадровВысшейКвалификации");
		ДанныеОбразования.ВидПослевузовскогоОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.Докторантура");
	ИначеЕсли Идентификатор = 14 Тогда 
		ДанныеОбразования.ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат");
	ИначеЕсли Идентификатор = 15 Тогда 
		ДанныеОбразования.ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеПодготовкаКадровВысшейКвалификации");
		ДанныеОбразования.ВидПослевузовскогоОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.АспирантураОрдинатураАдъюнктура");
	КонецЕсли;
	
	Возврат ДанныеОбразования;
	
КонецФункции

Функция ВидОбразованияПоИдентификаторуSuperJob(Идентификатор) Экспорт
	
	ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка");
	
	Если Идентификатор = 2 Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразование");
	ИначеЕсли Идентификатор = 3 Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.НеполноеВысшееОбразование");
	ИначеЕсли Идентификатор = 4 Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование");
	ИначеЕсли Идентификатор = 5 Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование");
	ИначеЕсли Идентификатор = 6 Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ОсновноеОбщееОбразование");
	ИначеЕсли Идентификатор = 7 Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат");
	ИначеЕсли Идентификатор = 8 Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура");
	ИначеЕсли Идентификатор = 9 Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.АспирантураОрдинатураАдъюнктура");
	ИначеЕсли Идентификатор = 10 Тогда
		ВидОбразования = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.Докторантура");
	КонецЕсли;

	Возврат ВидОбразования;
	
КонецФункции

Функция СреднееПолноеОбщееОбразование() Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование");

КонецФункции 

Функция МужскойПол() Экспорт
	
	Возврат ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской");	
	
КонецФункции

Функция ЖенскийПол() Экспорт
	
	Возврат ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский");
	
КонецФункции

Функция ИмяСправочникаКандидатов() Экспорт
	
	Возврат "Кандидаты";
	
КонецФункции

Функция УникальноеИмяРеквизита() Экспорт
	
	Возврат ЗарплатаКадрыРасширенныйКлиентСервер.УникальноеИмяРеквизита();
	
КонецФункции

Функция ГруппаКнопокДляЗагрузкиССайта(Форма) Экспорт
	
	Возврат Форма.Элементы.КоманднаяПанельФормы.ПодчиненныеЭлементы.ФормаЗагрузить;
	
КонецФункции

#КонецОбласти
